app/views/articles/show.html.erb

          <small>
            <%= pluralize(@article.user.articles.count, "article") if @article.user.articles %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]