app/controllers/articles_controller.rb

	def index
		@articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

	def create
		# render plain: params[:article].inspect
		@article = Article.new(article_params)
		@article.user = current_user

		if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "asdasdasda"], ["description", "123213123123123"], ["created_at", "2018-02-15 11:00:23.588813"], ["updated_at", "2018-02-15 11:00:23.588813"], ["user_id", 2]]

	def update
		if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "Este article foi editado"], ["updated_at", "2018-02-13 14:18:13.660496"], ["id", 9]]